---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainThickness
source: html/d726510c-c27d-98e3-4f0e-2ea0377e9518.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainThickness Property

"Main Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldMainThickness { get; }
```